Конфигурация_ServiceMP/src/InformationRegisters/ксЗапросНаНовуюНоменклатуру/ксЗапросНаНовуюНоменклатуру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксЗапросНаНовуюНоменклатуру</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лог</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИзначальное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзмСтр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>идЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация_ServiceMP/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация_ServiceMP/src/InformationRegisters/ксЗапросНаНовуюНоменклатуру/Forms/ФормаЗаписи1/Module.bsl
&НаСервереБезКонтекста
Функция  РОдительНом(Ном)
	Возврат Ном.РОдитель;
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент=Неопределено)
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		ГруппаНоменклатуры = РОдительНом(Запись.Номенклатура);
	КонецесЛИ;
	Если ЗначениеЗаполнено(ЕдИзм)=Ложь ТОгда
		ЕдИзм = ПолучитьШт(Запись.Номенклатура);
	КонецЕСЛИ;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНоменклатуруНаСервере(Имя,РОд,ЕдИзм,Ном)
	
	Если ЗначениеЗаполнено(Ном)=Ложь Тогда
		Обк = Справочники.Номенклатура.СоздатьЭлемент();
		Обк.Наименование = Имя;
		Обк.НаименованиеПолное = Имя;
		Обк.СтавкаНДС = перечисления.СтавкиНДС.НДС18;
		Обк.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("2.4.1");
	ИНАче
		Обк = ном.ПолучитьОбъект();
	КонецесЛИ;
	Обк.БазоваяЕдиницаИзмерения = ЕдИзм;
	Обк.Родитель = Род;
	Обк.Записать();
	
	Возврат Обк.Ссылка;
	
КонецФункции


&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	Если СокрлП(Запись.ПричинаОтказа)<>"" ТОгда
		Предупреждение("Есть причина отказа!");
		Возврат;
	КонецЕСЛИ;
	
	Запись.Номенклатура = СоздатьНоменклатуруНаСервере(Запись.Наименование,ГруппаНоменклатуры,ЕдИзм,Запись.Номенклатура);
	ЗаписатьНаСервере();
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НоменклатураПриИзменении();
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Элементы.СоздатьНоменклатуру.Заголовок = "Изменить номенклатуру";
	КонецеСЛИ;
	ВидимостьНаимИзнач();	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНаимИзнач()
	Элементы.НаименованиеИзначальное.Видимость = СокрЛП(Запись.Наименование)<>СокрЛП(Запись.НаименованиеИзначальное);
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьШт(Ном)
	Если ЗначениеЗаполнено(Ном) ТОгда
		Возврат Ном.БазоваяЕдиницаИзмерения;	
	ИНАче
		Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
	КонецеСЛИ;
КонецФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Обк = РеквизитФормыВЗначение("Запись");
	Обк.ДатаЗакрытияЗапроса = ТекущаяДата();
	Обк.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеФормыПриЗаписи() 
	ВидимостьНаимИзнач();
	ЭтаФорма.Прочитать();
	Если Запись.ПричинаОтказа<>"" Тогда
		Элементы.ПричинаОтказа.ЦветФона = WebЦвета.ЛососьСветлый;
		Элементы.Номенклатура.ЦветФона = Новый Цвет;
	ИНаче
		Элементы.Номенклатура.ЦветФона = WebЦвета.БледноЗеленый;
		Элементы.ПричинаОтказа.ЦветФона = Новый Цвет;
	КонецЕСЛИ;
	ОповеститьОбИзменении(ПолучитьКлючЗаписи(Запись.идЗапроса));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписи(идЗапроса)
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("идЗапроса",	идЗапроса);

	// Почему-то нужно создавать запись через массив (по другому не взлетало)
	МассивКлюча = Новый Массив;
	МассивКлюча.Добавить(СтруктураФормы);
	
	// Создание ключа записи регистра сведений
	Возврат Новый ("РегистрСведенийКлючЗаписи.ксЗапросНаНовуюНоменклатуру", МассивКлюча);	
	
КонецФункции

&НаКлиенте
Процедура Отказать(Команда)
	Если СокрлП(Запись.ПричинаОтказа)="" ТОгда
		Предупреждение("Не указана причина отказа!");
		Возврат;
	КонецЕСЛИ;
	ЗаписатьНаСервере();
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(Запись.ЕдИзмСтр);
	Если ЗначениеЗаполнено(ЕдИзм)= Ложь ТОгда
		Элементы.ЕдИзм.Заголовок = "Ед: "+Запись.ЕдИзмСтр;
	КонецЕСЛИ;
КонецПроцедуры
